app/controllers/posts_controller.rb

  def delete
    Post.destroy(params[:id])
---
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 3]]