app/controllers/posts_controller.rb

DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 4]]
---
  def destroy
    Post.destroy(params[:id])